---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.AccessDeniedException
source: html/2d04aafb-3332-dc3b-4bad-30064149c19a.htm
---
# AccessDeniedException Members

Retrieves data needed to serialize the target object.